/** **************************************************************************************
 * @file
 * @brief           定时事务处理
 * @note
 * @author          zhangjiayi
 * @date            2023-04-02 12:23:23
 * @version         v0.1
 * @copyright       Copyright (c) 2020-2050  zhangjiayi
 * @par             LastEdit
 * @LastEditTime    2023-04-02 12:23:23
 * @LastEditors     zhangjiayi
 * @FilePath        /test/myware/time_handle.c
 *****************************************************************************************/
#include "packet_handle.h"
#include "MBI6024.h"
#include "74HC165.h"
#include "coin.h"
/** **************************************************************************************
* @brief 10ms 定时事务处理
* @note
* @param void
* @return void
* @retval
*****************************************************************************************/
void time_10ms_handle(void)
{
    ;

    //DOG_Identify();
}

/** **************************************************************************************
* @brief 10ms 定时事务处理
* @note
* @param void
* @return void
* @retval
*****************************************************************************************/
void time_100ms_handle(void)
{
    // DOG_LED_display();
}

/** **************************************************************************************
* @brief 10ms 定时事务处理
* @note
* @param void
* @return void
* @retval
*****************************************************************************************/
void time_1000ms_handle(void)
{
    ;
}
